In [1]:
import pandas as pd

df = pd.DataFrame({
    'Name': [' Alice ', 'BOB', '  Charlie  '],
    'Age': [25, None, 30],
    'City': ['new york', 'LOS ANGELES', 'Chicago']
})

In [2]:
df

          Name   Age         City
0       Alice   25.0     new york
1          BOB   NaN  LOS ANGELES
2    Charlie    30.0      Chicago

In [3]:
## Converting Name to UPPER case
df['Name'] = df['Name'].apply(lambda x: x.upper())

In [4]:
## Converting City to UPPER case
df['City'] = df['City'].apply(lambda x: x.upper())

In [5]:
df

          Name   Age         City
0       ALICE   25.0     NEW YORK
1          BOB   NaN  LOS ANGELES
2    CHARLIE    30.0      CHICAGO

In [6]:
## Removing the unwanted white spaces in Name

df['Name'] = df['Name'].apply(lambda x: x.strip())
df

      Name   Age         City
0    ALICE  25.0     NEW YORK
1      BOB   NaN  LOS ANGELES
2  CHARLIE  30.0      CHICAGO

In [7]:
## Replacing missing value in AGE with Avg of Age

avg_age = df['Age'].mean()
print('Avg of age: ', avg_age)
df['Age'] = df['Age'].apply(lambda x: avg_age if pd.isnull(x) else x)
df

Avg of age:  27.5

      Name   Age         City
0    ALICE  25.0     NEW YORK
1      BOB  27.5  LOS ANGELES
2  CHARLIE  30.0      CHICAGO

In [8]:
## New features - Square age
df['Age Square'] = df['Age'].apply(lambda x: x*x)
df

      Name   Age         City  Age Square
0    ALICE  25.0     NEW YORK      625.00
1      BOB  27.5  LOS ANGELES      756.25
2  CHARLIE  30.0      CHICAGO      900.00